<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NationalitiesSeeder extends Seeder
{
    
    public function run()
    {
        $nationalities = [
            ['name' => 'كويتي'] ,['name' => 'ألباني'], ['name' => 'أفغاني'], ['name' => 'ألباني'], ['name' => 'جزائري'], ['name' => 'أمريكي'],
            ['name' => 'أندوري'], ['name' => 'أنغولي'], ['name' => 'أنتيغوي'], ['name' => 'أرجنتيني'],
            ['name' => 'أرميني'], ['name' => 'أسترالي'], ['name' => 'نمساوي'], ['name' => 'أذربيجاني'],
            ['name' => 'باهامي'], ['name' => 'بحريني'], ['name' => 'بنغلاديشي'], ['name' => 'بربادوسي'],
            ['name' => 'بيلاروسي'], ['name' => 'بلجيكي'], ['name' => 'بليزي'], ['name' => 'بنيني'],
            ['name' => 'بوتاني'], ['name' => 'بوليفي'], ['name' => 'بوسني'], ['name' => 'بوتسواني'],
            ['name' => 'برازيلي'], ['name' => 'بريطاني'], ['name' => 'بروناي'], ['name' => 'بلغاري'],
            ['name' => 'بوركيني'], ['name' => 'بورمي'], ['name' => 'بوروندي'], ['name' => 'كمبودي'],
            ['name' => 'كاميروني'], ['name' => 'كندي'], ['name' => 'كاب فيردي'], ['name' => 'أفريقي وسطي'],
            ['name' => 'تشادي'], ['name' => 'تشيلي'], ['name' => 'صيني'], ['name' => 'كولومبي'],
            ['name' => 'جزر القمر'], ['name' => 'كونغولي'], ['name' => 'كوستاريكي'], ['name' => 'كرواتي'],
            ['name' => 'كوبي'], ['name' => 'قبرصي'], ['name' => 'تشيكي'], ['name' => 'دنماركي'],
            ['name' => 'جيبوتي'], ['name' => 'دومينيكاني'], ['name' => 'هولندي'], ['name' => 'تيموري شرقي'],
            ['name' => 'إكوادوري'], ['name' => 'مصري'], ['name' => 'إماراتي'], ['name' => 'غيني استوائي'],
            ['name' => 'إريتري'], ['name' => 'إستوني'], ['name' => 'إثيوبي'], ['name' => 'فيجي'],
            ['name' => 'فلبيني'], ['name' => 'فنلندي'], ['name' => 'فرنسي'], ['name' => 'غابوني'],
            ['name' => 'غامبي'], ['name' => 'جورجي'], ['name' => 'ألماني'], ['name' => 'غاني'],
            ['name' => 'يوناني'], ['name' => 'غرينادي'], ['name' => 'غواتيمالي'], ['name' => 'غيني'],
            ['name' => 'غوياني'], ['name' => 'هايتي'], ['name' => 'هندوراسي'], ['name' => 'مجري'],
            ['name' => 'آيسلندي'], ['name' => 'هندي'], ['name' => 'إندونيسي'], ['name' => 'إيراني'],
            ['name' => 'عراقي'], ['name' => 'إيرلندي'], ['name' => 'إسرائيلي'], ['name' => 'إيطالي'],
            ['name' => 'جامايكي'], ['name' => 'ياباني'], ['name' => 'أردني'], ['name' => 'كازاخي'],
            ['name' => 'كيني'], ['name' => 'كيريباتيتي'], ['name' => 'قيرغيزي'],
            ['name' => 'لاوسي'], ['name' => 'لاتفي'], ['name' => 'لبناني'], ['name' => 'ليبيري'],
            ['name' => 'ليبي'], ['name' => 'ليختنشتايني'], ['name' => 'لتواني'], ['name' => 'لوكسمبورغي'],
            ['name' => 'مقدوني'], ['name' => 'مدغشقري'], ['name' => 'ملاوي'], ['name' => 'ماليزي'],
            ['name' => 'مالديفي'], ['name' => 'مالي'], ['name' => 'مالطي'], ['name' => 'موريتاني'],
            ['name' => 'موريشيوسي'], ['name' => 'مكسيكي'], ['name' => 'مولدوفي'], ['name' => 'موناكي'],
            ['name' => 'منغولي'], ['name' => 'مونتينيغري'], ['name' => 'مغربي'], ['name' => 'موزمبيقي'],
            ['name' => 'ناميبي'], ['name' => 'ناوروي'], ['name' => 'نيبالي'], ['name' => 'نيوزيلندي'],
            ['name' => 'نيكاراغوي'], ['name' => 'نيجيري'], ['name' => 'كوري شمالي'], ['name' => 'نرويجي'],
            ['name' => 'عماني'], ['name' => 'باكستاني'], ['name' => 'بالاوي'], ['name' => 'فلسطيني'],
            ['name' => 'بنمي'], ['name' => 'بابوا غيني جديد'], ['name' => 'باراغواياني'], ['name' => 'بيروفي'],
            ['name' => 'بولندي'], ['name' => 'برتغالي'], ['name' => 'قطري'], ['name' => 'روماني'],
            ['name' => 'روسي'], ['name' => 'رواندي'], ['name' => 'ساموي'], ['name' => 'سعودي'],
            ['name' => 'سنغالي'], ['name' => 'صربي'], ['name' => 'سيشلي'], ['name' => 'سنغافوري'],
            ['name' => 'سلوفاكي'], ['name' => 'سلوفيني'], ['name' => 'صومالي'], ['name' => 'جنوب أفريقي'],
            ['name' => 'كوري جنوبي'], ['name' => 'إسباني'], ['name' => 'سريلانكي'], ['name' => 'سوداني'],
            ['name' => 'سوازي'], ['name' => 'سويدي'], ['name' => 'سويسري'], ['name' => 'سوري'],
            ['name' => 'طاجيكي'], ['name' => 'تنزاني'], ['name' => 'تايلاندي'], ['name' => 'توغولي'],
            ['name' => 'تونسي'], ['name' => 'تركي'], ['name' => 'تركماني'], ['name' => 'أوغندي'],
            ['name' => 'أوكراني'], ['name' => 'إماراتي'], ['name' => 'أوروغواياني'], ['name' => 'أوزبكي'],
            ['name' => 'فنزويلي'], ['name' => 'فيتنامي'], ['name' => 'يمني'], ['name' => 'زامبي'],
            ['name' => 'زيمبابوي']
        ];


        DB::table('nationalities')->insertOrIgnore($nationalities);
    }
}
